Revit 2027 API
LineSegment.EndParameter Property
 Parameter associated with the end point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndParameter { get; }
Public ReadOnly Property EndParameter As Double
	Get
public:
property double EndParameter {
	double get ();
}
member EndParameter : float with get
Property Value
Double
See Also
Reference
LineSegment Class
Autodesk.Revit.DB Namespace